Revit 2017 API
TextNode.IsForRightToLeftReading Property
 Indicates whether the text uses Right-To-Left reading order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017.")]
public bool IsForRightToLeftReading { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017.")> _
Public ReadOnly Property IsForRightToLeftReading As Boolean
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017.")]
public:
property bool IsForRightToLeftReading {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace